Sank7383/ESP8266_Newmesh/NewMeshNOW.h

#include <ESP8266WiFi.h>
#include <WebSocketsServer.h>
#include <ESP8266WebServer.h>
#include <WebSocketsClient.h>
#include <Hash.h>
#include <ESP8266httpUpdate.h>
#include <EEPROM.h>
void ESPrestart();
byte ESPN[5] = {0,0,0,0,0};
#define NewMeshLib
unsigned long nowmillis=0,ethchecknow=0;
bool manulalAP=false;
void setup_AP(bool forceRestart = false);
#ifndef MQTTNOTREQUIRED
#include <PubSubClient.h>
void Mysubscribe(int id, int unsub = 0);
#endif
#include <time.h>
#include <TimeLib.h>
#define QUOTE(...) F(#__VA_ARGS__)
#ifdef NURSECALLING
#define MESHNETWORK "MESH"
#pragma message "NNETWORK set"
#else
#define MESHNETWORK "MESH"
#endif
#ifdef ether86
#define USING_ENC28J60      true
#include <SPI.h>
#define CSPIN       15      // 5
#include <ENC28J60lwIP.h>
#define SHIELD_TYPE       "ESP8266_ENC28J60 Ethernet"
ENC28J60lwIP eth(CSPIN);
#include <ESP8266WiFi.h>
#endif
#ifdef ether86
using TCPClient = WiFiClient;
#endif
int ethercon=0;

#ifndef MQTTNOTREQUIRED
const char mqtt_server[4][20] = {"27.54.182.52", "116.72.19.155", "123.201.110.114", "www.ask4token.com"};
WiFiClient espClient;

PubSubClient client(espClient);
unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE (500)
char msg[MSG_BUFFER_SIZE];
#endif
uint8_t gettime = 0;
// Espalexa/Alexa integration intentionally dropped for v1 (out of scope,
// see plan) — no external dependency on Espalexa.h in this build.

void sendAllDevices();
void handleBinUpdate(int local);
int disconnectcount = 0;
IPAddress apIP=IPAddress(0,0,0,0);
#define dbgPrintln
#ifndef dbgPrintln
#define DEBUG_WIFI_MULTI(fmt, ...) Serial.printf_P((PGM_P)PSTR(fmt), ##__VA_ARGS__)
#define debugmode
void dbgPrintln(int lvl, String msg)
{
  Serial.println(msg);
}

void dbgPrintln(int lvl, int msg)
{
  Serial.println(msg);
}
#else
#define DEBUG_WIFI_MULTI(...)
#endif

String ID = String(ESP.getChipId());
char outTopic[64]={0};  // allocate enough space
char msgp[1000];        // scratch buffer for getCurrentStatus1() snapshots
long wclienttimedelay=5000;

unsigned long lst_wscon=0;

#include "PolledTimeout.h"
#include <limits.h>
#include <string.h>
#include <vector>

struct WifiAPEntry
{
  char *ssid;
  char *passphrase;
};

typedef std::vector<WifiAPEntry> WifiAPlist;

#ifndef WIFI_CONNECT_TIMEOUT_MS
#define WIFI_CONNECT_TIMEOUT_MS 5000
#endif

#ifndef WIFI_SCAN_TIMEOUT_MS
#define WIFI_SCAN_TIMEOUT_MS 5000
#endif

WifiAPlist _APlist;
bool _firstRun = false;
unsigned long lastdecode=0;
char lastdecodestring[301];
void decodeString1(const char *msm, int isServer);
void decodeString(const char *msm, int isServer);
void callback(char *topic, byte *payload, unsigned int length);
void myrun();

uint8_t myrunmode = 0;
long myruntime = 0;
long netsoltime = 0;
uint8_t myruncount = 0;
int8_t scanResult;
int32_t rssi;
uint8_t encType;
uint8_t *bssid;
int32_t channel;
bool hidden;
uint8_t known[20];
uint8_t numNetworks = 0;
uint8_t myrunmodeindex = 0;

bool APlistExists(const char *ssid, const char *passphrase)
{
  if (!ssid || (*ssid == 0x00) || (strlen(ssid) > 32))
  {
    return false;
  }

  for (auto entry : _APlist)
  {
    if (!strcmp(entry.ssid, ssid))
    {
      if (!passphrase)
      {
        if (!strcmp(entry.passphrase, ""))
        {
          return true;
        }
      }
      else
      {
        if (!strcmp(entry.passphrase, passphrase))
        {
          return true;
        }
      }
    }
  }
  return false;
}

void APlistClean(void)
{
  for (auto entry : _APlist)
  {
    if (entry.ssid)
    {
      free(entry.ssid);
    }
    if (entry.passphrase)
    {
      free(entry.passphrase);
    }
  }

  _APlist.clear();
}

void cleanAPlist(void)
{
  APlistClean();
}

bool existsAP(const char *ssid, const char *passphrase)
{
  return APlistExists(ssid, passphrase);
}
bool APlistAdd(const char *ssid, const char *passphrase)
{
  WifiAPEntry newAP;

  if (!ssid || (*ssid == 0x00) || (strlen(ssid) > 32))
  {
    return false;
  }

  if (passphrase && (strlen(passphrase) > 64))
  {
    return false;
  }

  if (APlistExists(ssid, passphrase))
  {
    return true;
  }

  newAP.ssid = strdup(ssid);

  if (!newAP.ssid)
  {
    return false;
  }

  if (passphrase)
  {
    newAP.passphrase = strdup(passphrase);
  }
  else
  {
    newAP.passphrase = strdup("");
  }

  if (!newAP.passphrase)
  {
    free(newAP.ssid);
    return false;
  }

  _APlist.push_back(newAP);
  return true;
}
bool addAP(const char *ssid, const char *passphrase)
{
  return APlistAdd(ssid, passphrase);
}

ESP8266WebServer server(80);
WebSocketsServer webSocket = WebSocketsServer(81);
WebSocketsClient webSocketClient;
#include "MYESPNOW.h"
#define EMMDBG_WIFI 1

uint8_t itemId = 0;
int16_t Vdate[20] = {0, 0, 0, 0, 0, 0};

unsigned char h2int(char c)
{
  if (c >= '0' && c <= '9')
  {
    return ((unsigned char)c - '0');
  }
  if (c >= 'a' && c <= 'f')
  {
    return ((unsigned char)c - 'a' + 10);
  }
  if (c >= 'A' && c <= 'F')
  {
    return ((unsigned char)c - 'A' + 10);
  }
  return (0);
}

String urldecode(String str)
{
  String encodedString = "";
  char c;
  char code0;
  char code1;
  for (int i = 0; i < str.length(); i++)
  {
    c = str.charAt(i);
    if (c == '+')
    {
      encodedString += ' ';
    }
    else if (c == '%')
    {
      i++;
      if (i >= str.length()) break;
      code0 = str.charAt(i);
      i++;
      if (i >= str.length()) break;
      code1 = str.charAt(i);
      c = (h2int(code0) << 4) | h2int(code1);
      encodedString += c;
    }
    else
    {
      encodedString += c;
    }
  }

  return encodedString;
}

char urlencodes[128]; // bigger buffer

const char *urlencode(const char *str) {
    if (!str || strlen(str) == 0 || strcmp(str, "null") == 0) {
        urlencodes[0] = '\0';
        return urlencodes;
    }

    char *encodedString = urlencodes;
    size_t outLen = 0;
    size_t maxLen = sizeof(urlencodes) - 1;

    for (size_t i = 0; str[i] && outLen < maxLen; i++) {
        char c = str[i];

        if (c == ' ') {
            if (outLen + 1 < maxLen) { *encodedString++ = '+'; outLen++; }
        } else if (isalnum((unsigned char)c) || c == '.' || c == '-' || c == '_') {
            if (outLen + 1 < maxLen) { *encodedString++ = c; outLen++; }
        } else {
            if (outLen + 3 < maxLen) {
                *encodedString++ = '%';
                *encodedString++ = "0123456789ABCDEF"[(c >> 4) & 0xF];
                *encodedString++ = "0123456789ABCDEF"[c & 0xF];
                outLen += 3;
            }
        }
    }

    *encodedString = '\0';
    return urlencodes;
}

String urlencode(String str)
{
  String encodedString = "";
  char c;
  char code0;
  char code1;
  if (str.length() == 0)
    return "";
  if (str == "null")
    return "";
  for (int i = 0; i < str.length(); i++)
  {
    c = str.charAt(i);
    if (c >= 123 || c < 32)
      continue;
    if (c == ' ')
    {
      encodedString += '+';
    }
    else if (c == '.')
    {
      encodedString += '.';
    }
    else if (isalnum(c))
    {
      encodedString += c;
    }
    else
    {
      code1 = (c & 0xf) + '0';
      if ((c & 0xf) > 9)
      {
        code1 = (c & 0xf) - 10 + 'A';
      }
      c = (c >> 4) & 0xf;
      code0 = c + '0';
      if (c > 9)
      {
        code0 = c - 10 + 'A';
      }
      encodedString += '%';
      encodedString += code0;
      encodedString += code1;
    }
  }
  return encodedString;
}

