Sank7383/ESP8266_Newmesh/NewMeshNOW.h
  if (ethercon==1) return;
  if (_firstRun)
  {
    _firstRun = false;
    if (strlen(WiFi.SSID().c_str()))
    {
      WiFi.begin();
    }
  }

  if (status == WL_CONNECTED)
  {
    if (firsttime<120) firsttime=0;
    if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_") )
    {
      if (t - netsoltime > 300000 && netsoltime > 0)
      {
        WiFi.disconnect();
        myrunmode = 0;
        return;
      }
    }
    if (WiFi.status() == 3 && WiFi.localIP().toString() == "(IP unset)")
      WiFi.disconnect(true);
    myruncount = 0;
    return;
  }

  if (myrunmode == 0)
  {
    if (myConfig.type[0]==2 && myConfig.mesh_en) return;
    WiFi.disconnect();
    WiFi.scanDelete();
    WiFi.disconnect();
    WiFi.scanNetworks(true);
    myrunmode = 1;
    myruncount++;
    return;
  }

  if (myrunmode == 1)
  {
    scanResult = WiFi.scanComplete();
    if (scanResult < 0)
      return;
    myrunmode = 2;
  }

  if (myrunmode == 2)
  {
    numNetworks = 0;
    for (int8_t i = 0; i < scanResult && numNetworks < 20; i++)
    {
      String ssid;
      WiFi.getNetworkInfo(i, ssid, encType, rssi, bssid, channel, hidden);
      for (auto entry : _APlist)
      {
        if (ssid == entry.ssid)
        {
          known[numNetworks++] = i;
          break;   // one match per scanned network is enough; also bounds numNetworks < 20 via the outer loop guard
        }
      }
    }
    if (numNetworks == 0)
    {
      myrunmode = 3;
      for (uint8_t j = 0; j < _APlist.size(); j++)
      {
        auto &entry = _APlist[j];
        WiFi.begin(entry.ssid, entry.passphrase);
        break;
      }
      myrunmodeindex=1;
      myruntime = myruntime + 30000;
      ssidconnected=0;
      return;
    }

    myrunmode = 3;
    for (int i = 0; i < numNetworks; i++)
    {
      for (int j = i + 1; j < numNetworks; j++)
      {
        if (WiFi.RSSI(known[j]) > WiFi.RSSI(known[i]))
        {
          int8_t tmp;
          tmp = known[i];
          known[i] = known[j];
          known[j] = tmp;
        }
      }
    }
    myrunmodeindex = 0;
  }
  if (myrunmode == 3)
  {
    if (myrunmodeindex == numNetworks)
    {
      myruncount++;
      if (myruncount > 15)
      {
        myruncount = 0;
      }
      myrunmode = 0;
      myruntime = myruntime + 1000;
      return;
    }
    String ssid;
    WiFi.getNetworkInfo(known[myrunmodeindex], ssid, encType, rssi, bssid, channel, hidden);

    for (uint8_t j = 0; j < _APlist.size(); j++)
    {
      auto &entry = _APlist[j];
      if (ssid == entry.ssid)
      {
        if (ssid == "NETSOL" && (WiFi.softAPgetStationNum() > 0 || myruncount < 10))
        {
        }
        else
          WiFi.begin(ssid, entry.passphrase, channel, bssid);
        ssidconnected=0;
        myrunmodeindex++;
        myruntime = myruntime + 30000;
        return;
      }
    }

    myrunmode = 0;
    myruntime = myruntime + 1000;
    return;
  }

  return;
}
